Revit 2027 API
FamilyManager.GetParameter Method
Obtains the family parameter with the given built-in parameter identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyParameter GetParameter(
	ForgeTypeId parameterTypeId
)
Public Function GetParameter (
	parameterTypeId As ForgeTypeId
) As FamilyParameter
public:
FamilyParameter^ GetParameter(
	ForgeTypeId^ parameterTypeId
)
member GetParameter :
        parameterTypeId : ForgeTypeId -> FamilyParameter
Parameters
parameterTypeId ForgeTypeId
Identifier of the built-in parameter.
Return Value
FamilyParameter
Exceptions
Exception | Condition
ArgumentException |  parameterTypeId does not identify a built-in parameter. See Parameter.IsBuiltInParameter(ForgeTypeId) and Parameter.GetParameterTypeId(BuiltInParameter).
ArgumentNullException |  A non-optional argument was NULL
Remarks
Returns null if the parameter is not found.
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace